import '../Shared/Style/contact.css'

export function Contact() {
    return (
        <>
            <div className="wrapper_banner_wrapper_Contact">
                <div className="container">
                    <div className="wrapper_inside_history_back">
                        <a className="Home_page" href="../index.html">Ana səhifə</a>
                        <p className="teachers">/</p>
                        <p className="teachers">Əlaqə</p>
                    </div>
                </div>
            </div>
            <div className="banner_wrapper">
                <div className="container">
                    <div className="wrapper_go_back_navigation">
                        <a href="#" className="contact">
                            <p>Əlaqə</p>
                        </a>
                    </div>
                    <div className="wrapper_write_to_us">
                        <div className="wrapper_for_contacts">
                            <div className="contacts">
                                <p className="text_contacts">Bizimlə əlaqə saxlayın</p>
                                <div className="number_email_social_network">
                                    <div className="number_email">
                                        <div className="number several_contact">
                                            <img src="../icon/Frame 16.svg" alt="" />
                                            <div className="teacher_number">+994 50-000-00-00</div>
                                        </div>
                                        <div className="write_email several_contact">
                                            <img src="../icon/Frame 17.svg" alt="" />
                                            <div className="teacher_email">nümunə@gmail.com</div>
                                        </div>
                                    </div>
                                    <div className="click_social_network" >
                                        <a href="#">
                                            <svg className="change_icons_color" width="28" height="28" viewBox="0 0 28 28" xmlns="http://www.w3.org/2000/svg">
                                                <g clip-path="url(#clip0_273_6097)">
                                                    <path fill-rule="evenodd" clip-rule="evenodd" d="M14 0C6.26803 0 0 6.26803 0 14C0 21.732 6.26803 28 14 28C21.732 28 28 21.732 28 14C28 6.26803 21.732 0 14 0ZM15.4593 14.6149V22.2317H12.3078V14.6152H10.7333V11.9905H12.3078V10.4146C12.3078 8.2733 13.1968 7 15.7227 7H17.8256V9.62506H16.5111C15.5279 9.62506 15.4628 9.99186 15.4628 10.6765L15.4593 11.9902H17.8404L17.5618 14.6149H15.4593Z" />
                                                </g>
                                            </svg>
                                        </a>
                                        <a href="#">
                                            <svg className="change_icons_color" width="28" height="28" viewBox="0 0 28 28" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                <g clip-path="url(#clip0_273_6099)">
                                                    <path fill-rule="evenodd" clip-rule="evenodd" d="M14 0C6.26803 0 0 6.26803 0 14C0 21.732 6.26803 28 14 28C21.732 28 28 21.732 28 14C28 6.26803 21.732 0 14 0ZM10.9219 6.57842C11.7184 6.5422 11.9729 6.53333 14.0007 6.53333H13.9984C16.0268 6.53333 16.2804 6.5422 17.0768 6.57842C17.8718 6.61482 18.4146 6.74071 18.8907 6.92533C19.3822 7.11591 19.7975 7.371 20.2128 7.78633C20.6282 8.20137 20.8833 8.61793 21.0747 9.10904C21.2582 9.58382 21.3842 10.1264 21.4216 10.9213C21.4573 11.7178 21.4667 11.9722 21.4667 14.0001C21.4667 16.0279 21.4573 16.2818 21.4216 17.0782C21.3842 17.8728 21.2582 18.4155 21.0747 18.8905C20.8833 19.3814 20.6282 19.798 20.2128 20.213C19.798 20.6284 19.3821 20.8841 18.8911 21.0748C18.416 21.2595 17.8728 21.3853 17.078 21.4217C16.2815 21.458 16.0278 21.4668 13.9998 21.4668C11.9721 21.4668 11.7178 21.458 10.9213 21.4217C10.1265 21.3853 9.58382 21.2595 9.10875 21.0748C8.61793 20.8841 8.20138 20.6284 7.78651 20.213C7.37129 19.798 7.1162 19.3814 6.92533 18.8903C6.74082 18.4155 6.615 17.873 6.57842 17.0781C6.54238 16.2816 6.53333 16.0279 6.53333 14.0001C6.53333 11.9722 6.54267 11.7176 6.57831 10.9211C6.61407 10.1265 6.74007 9.58382 6.92516 9.10887C7.11649 8.61793 7.37164 8.20137 7.78697 7.78633C8.20202 7.37117 8.61858 7.11602 9.10968 6.92533C9.58446 6.74071 10.127 6.61482 10.9219 6.57842Z" />
                                                    <path fill-rule="evenodd" clip-rule="evenodd" d="M13.3309 7.87882C13.4609 7.87864 13.6009 7.8787 13.7518 7.87876L14.0008 7.87882C15.9944 7.87882 16.2307 7.88599 17.0179 7.92175C17.7459 7.95506 18.141 8.07669 18.4042 8.17889C18.7527 8.31422 19.0011 8.47604 19.2623 8.73737C19.5236 8.9987 19.6854 9.24761 19.8211 9.59604C19.9233 9.85895 20.0451 10.254 20.0782 10.982C20.114 11.7692 20.1217 12.0056 20.1217 13.9983C20.1217 15.991 20.114 16.2274 20.0782 17.0146C20.0449 17.7426 19.9233 18.1377 19.8211 18.4006C19.6857 18.749 19.5236 18.9972 19.2623 19.2583C19.001 19.5196 18.7528 19.6815 18.4042 19.8168C18.1414 19.9195 17.7459 20.0408 17.0179 20.074C16.2308 20.1099 15.9944 20.1176 14.0008 20.1176C12.007 20.1176 11.7707 20.1099 10.9835 20.074C10.2555 20.0404 9.86043 19.9188 9.59706 19.8166C9.24863 19.6813 8.99972 19.5195 8.73839 19.2581C8.47706 18.9968 8.3153 18.7485 8.17961 18.3999C8.07741 18.1371 7.95561 17.7419 7.92248 17.0139C7.88672 16.2268 7.87955 15.9904 7.87955 13.9964C7.87955 12.0025 7.88672 11.7673 7.92248 10.9802C7.95579 10.2522 8.07741 9.85708 8.17961 9.59388C8.31495 9.2454 8.47706 8.99655 8.73839 8.73521C8.99972 8.47388 9.24863 8.31206 9.59706 8.17644C9.86026 8.07377 10.2555 7.95244 10.9835 7.91895C11.6723 7.88786 11.9393 7.87853 13.3309 7.87695V7.87882ZM17.9864 9.11864C17.4918 9.11864 17.0904 9.5195 17.0904 10.0143C17.0904 10.509 17.4918 10.9103 17.9864 10.9103C18.4811 10.9103 18.8824 10.509 18.8824 10.0143C18.8824 9.51968 18.4811 9.11835 17.9864 9.11835V9.11864ZM10.1663 14C10.1663 11.8825 11.883 10.1656 14.0006 10.1655C16.1182 10.1655 17.8346 11.8824 17.8346 14C17.8346 16.1176 16.1183 17.8338 14.0008 17.8338C11.8831 17.8338 10.1663 16.1176 10.1663 14Z" />
                                                    <path d="M14.0007 11.5107C15.3752 11.5107 16.4896 12.625 16.4896 13.9997C16.4896 15.3742 15.3752 16.4886 14.0007 16.4886C12.6261 16.4886 11.5118 15.3742 11.5118 13.9997C11.5118 12.625 12.6261 11.5107 14.0007 11.5107Z" />
                                                </g>
                                            </svg>
                                        </a>
                                        <a href="#">
                                            <svg className="change_icons_color" width="28" height="28" viewBox="0 0 28 28" xmlns="http://www.w3.org/2000/svg">
                                                <g clip-path="url(#clip0_273_6101)">
                                                    <path fill-rule="evenodd" clip-rule="evenodd" d="M14 0C6.26803 0 0 6.26803 0 14C0 21.732 6.26803 28 14 28C21.732 28 28 21.732 28 14C28 6.26803 21.732 0 14 0ZM6.72093 11.5954H9.89363V21.1281H6.72093V11.5954ZM10.1026 8.64657C10.082 7.7119 9.41366 7 8.32825 7C7.2429 7 6.53333 7.7119 6.53333 8.64657C6.53333 9.56188 7.22196 10.2943 8.28707 10.2943H8.30737C9.41366 10.2943 10.1026 9.56188 10.1026 8.64657ZM17.6826 11.3716C19.7705 11.3716 21.3356 12.7343 21.3356 15.6623L21.3355 21.1281H18.163V16.0281C18.163 14.7471 17.7038 13.8729 16.5553 13.8729C15.6788 13.8729 15.1567 14.4622 14.9274 15.0314C14.8435 15.2354 14.8229 15.5196 14.8229 15.8045V21.1283H11.6498C11.6498 21.1283 11.6916 12.4902 11.6498 11.5957H14.8229V12.9459C15.244 12.2968 15.9981 11.3716 17.6826 11.3716Z" />
                                                </g>
                                            </svg>
                                        </a>
                                        <a href="#">
                                            <svg className="change_icons_color" width="28" height="28" viewBox="0 0 28 28" xmlns="http://www.w3.org/2000/svg">
                                                <g clip-path="url(#clip0_273_6102)">
                                                    <path fill-rule="evenodd" clip-rule="evenodd" d="M14 0C6.26803 0 0 6.26803 0 14C0 21.732 6.26803 28 14 28C21.732 28 28 21.732 28 14C28 6.26803 21.732 0 14 0ZM19.8343 9.18709C20.4768 9.36343 20.9828 9.88295 21.1546 10.5427C21.4667 11.7384 21.4667 14.2333 21.4667 14.2333C21.4667 14.2333 21.4667 16.7281 21.1546 17.924C20.9828 18.5837 20.4768 19.1032 19.8343 19.2796C18.6698 19.6 14 19.6 14 19.6C14 19.6 9.33018 19.6 8.16567 19.2796C7.52307 19.1032 7.01703 18.5837 6.8453 17.924C6.53333 16.7281 6.53333 14.2333 6.53333 14.2333C6.53333 14.2333 6.53333 11.7384 6.8453 10.5427C7.01703 9.88295 7.52307 9.36343 8.16567 9.18709C9.33018 8.86667 14 8.86667 14 8.86667C14 8.86667 18.6698 8.86667 19.8343 9.18709Z" />
                                                    <path d="M12.6 16.8005V12.1338L16.3333 14.4672L12.6 16.8005Z" />
                                                </g>
                                            </svg>
                                        </a>
                                    </div>
                                </div>
                            </div>
                        </div>
                        <div className="wrapper_for_letter">
                            <div className="container_send_a_letter">
                                <p className="write_us">Bizə yazın</p>
                                <form action="" className="send_a_letter">
                                    <div className="wrapper_input">
                                        <p className="firstName_lastName message">Ad və Soyadınız</p>
                                        <input type="text" name="" className="writeLetter" placeholder="Ad və Soyad" />
                                    </div>
                                    <div className="wrapper_input">
                                        <p className="Email message">Ad və Soyadınız</p>
                                        <input type="text" name="" className="writeLetter" placeholder="E-poçt ünvanızı daxil edin" />
                                    </div>
                                    <div className="wrapper_input">
                                        <p className="Subject message">Ad və Soyadınız</p>
                                        <input type="text" name="" className="writeLetter" placeholder="Müraciətin mövzusu" />
                                    </div>
                                    <div className="wrapper_input">
                                        <p className="Your_message message">Ad və Soyadınız</p>
                                        <textarea className="textarea" name="" id="" cols={30} rows={10} placeholder="Müraciət mətni"></textarea>
                                    </div>
                                </form>
                                <a href="#" className="button_send_me_letter">Göndər</a>
                            </div>
                        </div>
                    </div>
                </div>
            </div>
        </>
    )
}